tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "yt-dlp/taps"
brew "astyle"
brew "sqlite"
brew "python@3.9"
brew "python@3.10", link: true
brew "ccls"
brew "cmake"
brew "coreutils"
brew "ctags"
brew "curl"
brew "dnscrypt-proxy"
brew "docker"
brew "ffmpeg"
brew "gcc"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "languagetool"
brew "mackup"
brew "macvim"
brew "mas"
brew "neofetch"
brew "node"
brew "openjdk"
brew "php"
brew "pinentry-mac"
brew "r"
brew "reattach-to-user-namespace"
brew "subversion"
brew "tmux"
brew "tree"
brew "wget"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "cloudflare/cloudflare/cloudflared"
brew "yt-dlp/taps/yt-dlp"
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
cask "alfred", args: { appdir: "/Applications" }
cask "android-studio", args: { appdir: "/Applications" }
cask "appcleaner", args: { appdir: "/Applications" }
cask "bartender", args: { appdir: "/Applications" }
cask "bibdesk", args: { appdir: "/Applications" }
cask "chrome-remote-desktop-host", args: { appdir: "/Applications" }
cask "discord", args: { appdir: "/Applications" }
cask "endnote", args: { appdir: "/Applications" }
cask "font-source-code-pro", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "gpg-suite", args: { appdir: "/Applications" }
cask "gqrx", args: { appdir: "/Applications" }
cask "ifunbox", args: { appdir: "/Applications" }
cask "intel-power-gadget", args: { appdir: "/Applications" }
cask "istat-menus", args: { appdir: "/Applications" }
cask "mactex", args: { appdir: "/Applications" }
cask "mendeley", args: { appdir: "/Applications" }
cask "mendeley-reference-manager", args: { appdir: "/Applications" }
cask "skype", args: { appdir: "/Applications" }
cask "steam", args: { appdir: "/Applications" }
cask "tex-live-utility", args: { appdir: "/Applications" }
cask "texstudio", args: { appdir: "/Applications" }
cask "unity-hub", args: { appdir: "/Applications" }
cask "vlc", args: { appdir: "/Applications" }
cask "xquartz", args: { appdir: "/Applications" }
cask "zoom", args: { appdir: "/Applications" }
cask "zotero", args: { appdir: "/Applications" }
mas "Bandizip", id: 1265704574
mas "Cinebench", id: 1438772273
mas "Color Picker", id: 641027709
mas "GoodNotes", id: 1444383602
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Mendeley Web Importer", id: 1577516695
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PiPifier", id: 1160374471
mas "Redacted", id: 984968384
mas "Reeder", id: 1529448980
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
mas "Telegram", id: 747648890
mas "Termius", id: 1176074088
mas "Tweetbot", id: 1384080005
mas "Unicorn Blocker", id: 1231935892
mas "Unicorn HTTPS", id: 1475628500
mas "Xcode", id: 497799835
